generate_Data/generate_data_3d/flow_over_array_of_cylinders/isothermal/laminar/sim_orig/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/.";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    front
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    back
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    bot
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    cylinder
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
